//==============================================================================
// 포함 모듈 목록.
//==============================================================================
import { Component } from "../../core/component.js";
import { UINode } from "../../core/uinode.js";


//==============================================================================
// UI 컴포넌트.
// - UINode의 이벤트 체이닝에 참여하는 컴포넌트의 기반 클래스.
// - 소유 노드가 UINode이고 터치 차단 상태이면 터치 입력을 무시해야 한다.
//==============================================================================
export class UIComponent extends Component {
	//==============================================================================
	// 터치 차단 여부 반환.
	// 소유 노드가 UINode이고 이벤트 체이닝에 의해 차단된 상태이면 true를 반환한다.
	//==============================================================================
	/**
	 * @returns { boolean }
	 */
	isTouchBlocked() {
		const node = this.getNode();
		if (node instanceof UINode) {
			return node.isTouchBlocked();
		}
		return false;
	}
}
