//==============================================================================
// 포함 모듈 목록.
//==============================================================================
import { UIComponent } from "./uicomponent.js";


//==============================================================================
// 뷰 컴포넌트.
// - ScrollViewComponent, SnapScrollViewComponent 등 모든 뷰 컴포넌트의 기반 클래스.
// - 타입으로 하위 뷰 컴포넌트를 한번에 조회할 수 있다.
//   예: node.getComponent(ViewComponent)
//==============================================================================
export class ViewComponent extends UIComponent {
    
}
