//==============================================================================
// 포함 모듈 목록.
//==============================================================================
const System = globalThis;
import { Vector2 } from "../base/vector2.js";
import { Asset } from "../core/asset.js";


//==============================================================================
// 이미지 애셋.
//==============================================================================
export class ImageAsset extends Asset {
	//==============================================================================
	// 멤버 변수 목록.
	//==============================================================================
	/** @type { HTMLImageElement } */ image = null;


	//==============================================================================
	// 생성.
	//==============================================================================
	constructor() {
		super();
		
		this.image = new System.window.Image();
	}

	//==============================================================================
	// 비동기 애셋 로드.
	//==============================================================================
	/**
	 * @override
	 * @param { string } assetPath 
	 */
	async load(assetPath) {

		// 이미 로드 된 상태라면.
		const isLoaded = this.isLoaded();
		if (isLoaded) {
			return Promise.resolve();
		}

		await super.load(assetPath);
		this.image = new System.window.Image();
		this.image.src = assetPath;

		// 불러오기.
		await new Promise((resolve, reject) => {
			this.image.onload = () => {
				this.setLoaded(true);
				resolve();
			};
			this.image.onerror = () => {
				reject(new Error(`Load fail: ${assetPath}`));
			}
		});
	}

	//==============================================================================
	// 이미지 반환.
	//==============================================================================
	/**
	 * @returns { HTMLImageElement }
	 */
	getImage() {
		return this.image;
	}

	//==============================================================================
	// 이미지 크기 반환.
	//==============================================================================
	/**
	 * @returns { Vector2 }
	 */
	getImageSize() {
		return Vector2.create(this.image.width, this.image.height);
	}
}