//==============================================================================
// 포함 모듈 목록.
//==============================================================================
import { Asset } from "../core/asset.js";


//==============================================================================
// 이미지 애셋.
//==============================================================================
export class ImageAsset extends Asset {
	//==============================================================================
	// 멤버 변수 목록.
	//==============================================================================
	/** @type { HTMLImageElement } */ image = null;


	//==============================================================================
	// 생성.
	//==============================================================================
	constructor() {
		super();
		this.image = new window.Image();
	}

	//==============================================================================
	// 비동기 애셋 로드.
	//==============================================================================
	/**
	 * @override
	 * @param { string } assetPath 
	 */
	async load(assetPath) {
		// await super.load(assetPath);

		// 이미 로드 된 상태라면.
		if (super.isLoaded) {
			return Promise.resolve();
		}

		super.assetPath = assetPath;
		this.image = new window.Image();
		this.image.src = assetPath;

		// 불러오기.
		await new Promise((resolve, reject) => {
			this.image.onload = () => {
				super.isLoaded = true;
				resolve();
			};
			this.image.onerror = () => {
				reject(new Error(`Load fail: ${assetPath}`));
			}
		});
	}
}