// //==============================================================================
// // 포함 모듈 목록.
// //==============================================================================
// import { VObject } from "../base/object.js";
// import { VVector2 } from "../base/vector2.js";
// import { VRect } from "../base/rect.js";
// import { VOBB } from "../base/obb.js";


// //==============================================================================
// // 축 정렬된 바운딩 박스.
// //==============================================================================
// export class VAABB extends VObject {
// 	//==============================================================================
// 	// 멤버 변수 목록.
// 	//==============================================================================
// 	/** @private @type { VVector2 } */ #position;
// 	/** @private @type { VVector2 } */ #size;

// 	//==============================================================================
// 	// 생성.
// 	//==============================================================================
// 	/**
// 	 * @constructor
// 	 */
// 	constructor() {
// 		super();
// 		this.#position = VVector2.zero();
// 		this.#size = VVector2.zero();
// 	}

// 	//==============================================================================
// 	// 좌표와 충돌 검출.
// 	//==============================================================================
// 	/**
// 	 * @param { VVector2 } other
// 	 * @returns { boolean }
// 	 */
// 	contains(other) {
// 		if (other === null) {
// 			return false;
// 		}
// 		else if (other instanceof VVector2) {

// 		}
		
// 		return false;
// 	}

// 	//==============================================================================
// 	// 좌표와 충돌 검출.
// 	//==============================================================================
// 	/**
// 	 * @param { VRect | VAABB | VOBB } other
// 	 * @returns { boolean }
// 	 */
// 	overlaps(other) {
// 		if (other === null) {
// 			return false;
// 		}
// 		else if (other instanceof VRect) {

// 		}
// 		else if (other instanceof VAABB) {

// 		}
// 		else if (other instanceof VOBB) {

// 		}
// 		return false;
// 	}
// }