//==============================================================================
// 포함 모듈 목록.
//==============================================================================
const System = globalThis;
import { Object } from "../../base/object.js";
import { List } from "../collection/list.js";
import { Dictionary } from "../collection/dictionary.js";
import { Frame } from "../../core/frame.js";
import { AnimationClip, Animation } from "../rendering/animation.js";


//==============================================================================
// 애니메이션 상태.
//==============================================================================
export class AnimationState extends Object {
	//==============================================================================
	// 멤버 변수 목록.
	//==============================================================================
	/** @private @type { AnimationClip } */ #clip; // 클립.

	//==============================================================================
	// 생성.
	//==============================================================================
	/**
	 * @constructor
	 */
	constructor() {
		super();
		this.#clip = null;
	}
}


//==============================================================================
// 애니메이션 전환. (조건이 만족되면 대상 상태를 실행하는 애니메이션 노드 간 연결)
//==============================================================================
export class AnimationTransition extends Object {
	//==============================================================================
	// 멤버 변수 목록.
	//==============================================================================
	/** @private @type { AnimationState } */ #from;
	/** @private @type { AnimationState } */ #to;

	//==============================================================================
	// 생성.
	//==============================================================================
	/**
	 * @constructor
	 */
	constructor() {
		super();
	}
}


//==============================================================================
// 애니메이터.
//==============================================================================
export class Animator extends Object {
	//==============================================================================
	// 멤버 변수 목록.
	//==============================================================================
	/** @private @type { Animation } */ #animation; // 처리기.
	/** @private @type { List<AnimationState> } */ #states; // 상태 목록.
	/** @private @type { List<AnimationTransition> } */ #transitions; // 전환 목록.
	/** @private @type { Dictionary<string, System.Object> } */ #properties; // 애니메이터 프로퍼티 목록.

	//==============================================================================
	// 생성.
	//==============================================================================
	/**
	 * @constructor
	 */
	constructor() {
		super();
		this.#animation = new Animation();
		this.#states = new List();
		this.#transitions = new List();
		this.#properties = new Dictionary();
	}

	//==============================================================================
	// 갱신.
	//==============================================================================
	/**
	 * @param { number } timeDelta 
	 */
	tick(timeDelta) {
		this.#animation.tick(timeDelta);
	}

	//==============================================================================
	// 프로퍼티 설정.
	//==============================================================================
	/**
	 * @param { string } name
	 * @param { System.Object } value
	 */
	setProperty(name, value) {
		this.#properties.add(name, value);
	}

	//==============================================================================
	// 프로퍼티 반환.
	//==============================================================================
	/**
	 * @returns { System.Object }
	 */
	getProperty(name) {
		const value = this.#properties.get(name);
		return value;
	}

	//==============================================================================
	// 모든 프로퍼티 반환.
	//==============================================================================
	/**
	 * @returns { Dictionary<string, System.Object> }
	 */
	getProperties() {
		return this.#properties;
	}
}