//==============================================================================
// 포함 모듈 목록.
//==============================================================================
const System = globalThis;
import { Object } from "../base/object.js";
import { Rect } from "../base/rect.js";


//==============================================================================
// 이미지 영역.
//==============================================================================
export class Frame extends Object {
	//==============================================================================
	// 멤버 변수 목록.
	//==============================================================================
	/** @type { HTMLImageElement } */ #image; // 이미지.
	/** @type { Rect } */ #rect; // 이미지 내부 영역.

	//==============================================================================
	// 생성.
	//==============================================================================
	/**
	 * @param { HTMLImageElement } image
	 * @param { Rect | null } rect
	 */
	constructor(image, rect = null) {
		super();
		this.#image = image;
		if (image === null || image === undefined) {
			throw new System.Error("image is null.");
		}
		if (rect === null || rect === undefined) {
			this.#rect = Rect.create(0, 0, image.width, image.height);
		}
		else {
			// this.#rect = Rect.clamp(rect, Rect.zero(), Rect.create(0, 0, image.width, image.height));
			this.#rect = rect;
		}
	}

	//==============================================================================
	// 이미지 반환.
	//==============================================================================
	/**
	 * @returns { HTMLImageElement }
	 */
	getImage() {
		return this.#image;
	}

	//==============================================================================
	// 이미지 내부 영역 반환.
	//==============================================================================
	/**
	 * @returns { Rect }
	 */
	getImageRect() {
		return this.#rect;
	}
}