//==============================================================================
// 포함 모듈 목록.
//==============================================================================
import { VObject } from "../base/object.js";
import { VVector2 } from "../base/vector2.js";
import { VRenderer } from "./renderer.js";
import * as VMath from "../base/math.js";


//==============================================================================
// 피봇. (2D 좌표계를 기준으로 좌상(0,0) ~ 우하(1,1)을 기준으로 삼는다.)
//==============================================================================
export const Pivot2D = {
	topLeft: VVector2.create(0, 0),
	topCenter: VVector2.create(0.5, 0),
	topRight: VVector2.create(1, 0),
	middleLeft: VVector2.create(0, 0.5),
	middleCenter: VVector2.create(0.5, 0.5),
	middleRight: VVector2.create(1, 0.5),
	bottomLeft: VVector2.create(0, 1),
	bottomCenter: VVector2.create(0.5, 1),
	bottomRight: VVector2.create(1, 1),
}


//==============================================================================
// 영역 및 계층 객체.
//==============================================================================
/**
 * @class
 */
export class VNode extends VObject {
	//==============================================================================
	// 멤버 변수 목록.
	//==============================================================================
	/** @private @type { VNode | null } */ #parent; // 부모 노드.
	/** @private @type { VNode[] } */ #children; // 자식 노드 목록.
	/** @private @type { VVector2 } */ #position; // 위치.
	/** @private @type { VVector2 } */ #size; // 크기.
	/** @private @type { VVector2 } */ #scale; // 크기.
	/** @private @type { number } */ #rotation; // 회전값.
	/** @private @type { boolean } */ #isActive; // 활성화 여부.
	/** @private @type { boolean } */ #isVisible; // 렌더링 여부.
	/** @private @type { string } */ #color; // 컬러.
	/** @private @type { number } */ #opacity; // 투명도.
	/** @private @type { VVector2 } */ #pivot;

	//==============================================================================
	// 생성.
	//==============================================================================
	/**
	 * @constructor
	 */
	constructor() {
		super();
		this.#parent = null;
		this.#children = [];
		this.#position = VVector2.zero();
		this.#size = VVector2.zero();
		this.#scale = VVector2.one();
		this.#rotation = 0.0;
		this.#isActive = true;
		this.#isVisible = true;
		this.#color = "#ffffff"; // rgba(255, 255, 255, 1.0);
		this.#opacity = 1.0;
		this.#pivot = Pivot2D.middleCenter;
	}

	//==============================================================================
	// 갱신.
	//==============================================================================
	/**
	 * @virtual
	 * @param { number } timeDelta 
	 */
	update(timeDelta) {

	}

	//==============================================================================
	// 출력 상태 시작.
	//==============================================================================
	/**
	 * @virtual
	 * @param { VRenderer } renderer 
	 */
	beginDrawState(renderer) {
		const canvasContext = renderer.getCanvasContext();
		canvasContext.save();
	}

	//==============================================================================
	// 출력 상태 시작.
	//==============================================================================
	/**
	 * @virtual
	 * @param { VRenderer } renderer 
	 */
	preDraw(renderer) {
		const position = this.getPosition();
		const rotation = this.getRotation();
		const scale = this.getScale();
		const canvasContext = renderer.getCanvasContext();
		canvasContext.translate(position.x, position.y);
		canvasContext.rotate(rotation);
		canvasContext.scale(scale.x, scale.y);
		canvasContext.globalAlpha = this.#opacity;
		canvasContext.fillStyle = this.#color;
	}

	//==============================================================================
	// 출력.
	//==============================================================================
	/**
	 * @virtual
	 * @param { VRenderer } renderer 
	 */
	draw(renderer) {
		const canvasContext = renderer.getCanvasContext();
		canvasContext.fillRect(0, 0, this.#size.x, this.#size.y);
	}

	//==============================================================================
	// 출력 상태 시작.
	//==============================================================================
	/**
	 * @virtual
	 * @param { VRenderer } renderer 
	 */
	postDraw(renderer) {
		const canvasContext = renderer.getCanvasContext();
		canvasContext.globalAlpha = 1.0;
	}

	//==============================================================================
	// 출력 상태 종료.
	//==============================================================================
	/**
	 * @virtual
	 * @param { VRenderer } renderer 
	 */
	endDrawState(renderer) {
		const canvasContext = renderer.getCanvasContext();
		canvasContext.restore();
	}

	//==============================================================================
	// 부모 설정.
	//==============================================================================
	/**
	 * @param { VNode } parent 
	 */
	setParent(parent) {
		// 기존 부모가 존재 할 경우.
		if (this.#parent) {
			// 동일 부모.
			if (this.#parent === parent) {
				return;
			}

			// 자식 제거.
			const index = this.#parent.#children.indexOf(this);
			if (index !== -1) {
				this.#parent.#children.splice(index, 1);
			}

			this.#parent = null;
		}

		this.#parent = parent;

		// 새 부모가 존재 할 경우.
		if (this.#parent) {

			// 자식 추가.
			parent.#children.push(this);
		}
	}

	//==============================================================================
	// 자식 추가.
	//==============================================================================
	/**
	 * @param { VNode } child 
	 */
	addChild(child) {
		child.setParent(this);
	}

	//==============================================================================
	// 자식 제거.
	//==============================================================================
	/**
	 * @param { VNode } child 
	 */
	removeChild(child) {
		child.setParent(null);
	}

	//==============================================================================
	// 모든 자식 제거. (직계 자식 목록만 비우기 때문에 자식들이 소유한 계층 구조는 유지됨)
	//==============================================================================
	removeChildren() {
		for (let i = 0; i < this.#children.length; ++i) {
			const child = this.#children[i];
			this.removeChild(child);
		}
	}

	//==============================================================================
	// 부모가 없는지 여부 반환.
	//==============================================================================
	/**
	 * @returns { boolean } 
	 */
	isRoot() {
		return this.#parent === null;
	}

	//==============================================================================
	// 자식이 없는지 여부 반환.
	//==============================================================================
	/**
	 * @returns { boolean } 
	 */
	isLeaf() {
		return this.#children.length === 0;
	}

	//==============================================================================
	// 부모 반환.
	//==============================================================================
	/**
	 * @returns { VNode } 
	 */
	getParent() {
		return this.#parent;
	}

	//==============================================================================
	// 자식 목록 반환.
	//==============================================================================
	/**
	 * @returns { VNode[] } 
	 */
	getChildren() {
		return this.#children;
	}

	//==============================================================================
	// 자식 수 반환.
	//==============================================================================
	/**
	 * @returns { number } 
	 */
	getChildCount(index) {
		return this.#children.length;
	}

	//==============================================================================
	// 자식 반환.
	//==============================================================================
	/**
	 * @returns { VNode } 
	 */
	getChild(index) {
		return this.#children[index];
	}

	//==============================================================================
	// 위치 설정.
	//==============================================================================
	/**
	 * @param { VVector2 } position 
	 */
	setPosition(position) {
		this.#position = position;
	}

	//==============================================================================
	// 위치 반환.
	//==============================================================================
	/**
	 * @returns { VVector2 } 
	 */
	getPosition() {
		return this.#position;
	}

	//==============================================================================
	// 크기 설정.
	//==============================================================================
	/**
	 * @param { VVector2 } size 
	 */
	setSize(size) {
		this.#size = size;
	}

	//==============================================================================
	// 크기 반환.
	//==============================================================================
	/**
	 * @returns { VVector2 } 
	 */
	getSize() {
		return this.#size;
	}

	//==============================================================================
	// 크기 설정.
	//==============================================================================
	/**
	 * @param { VVector2 } scale 
	 */
	setScale(scale) {
		this.#scale = scale;
	}

	//==============================================================================
	// 크기 반환.
	//==============================================================================
	/**
	 * @returns { VVector2 } 
	 */
	getScale() {
		return this.#scale;
	}

	//==============================================================================
	// 회전 설정.
	//==============================================================================
	/**
	 * @param { number } rotation 
	 */
	setRotation(rotation) {
		this.#rotation = rotation;
	}

	//==============================================================================
	// 회전 반환.
	//==============================================================================
	/**
	 * @returns { number } 
	 */
	getRotation() {
		return this.#rotation;
	}

	//==============================================================================
	// 활성화 상태 설정.
	//==============================================================================
	/**
	 * @param { boolean } active 
	 */
	setActive(active) {
		this.#isActive = active;
	}

	//==============================================================================
	// 현재부터 루트까지 계층 전체의 활성화 상태 반환. (루트까지 하나라도 비활성화상태면 false 반환)
	//==============================================================================
	/**
	 * @returns { boolean } 
	 */
	isActiveInHierarchy() {
		if (this.isActive()) {
			let current = this;
			while (current !== null) {
				if (current.isActive()) {
					current = current.getParent();
				}
				else {
					return false;
				}
			}
			return true;
		} else {
			return false;
		}
	}

	//==============================================================================
	// 활성화 상태 반환.
	//==============================================================================
	/**
	 * @returns { boolean } 
	 */
	isActive() {
		return this.#isActive;		
	}

	//==============================================================================
	// 가시 상태 설정.
	//==============================================================================
	/**
	 * @param { boolean } visible 
	 */
	setVisible(visible) {
		this.#isVisible = visible;
	}

	//==============================================================================
	// 현재부터 루트까지 계층 전체의 가시 상태 반환. (루트까지 하나라도 비활성화상태면 false 반환)
	//==============================================================================
	/**
	 * @returns { boolean } 
	 */
	isVisibleInHierarchy() {
		if (this.isVisible()) {
			let current = this;
			while (current !== null) {
				if (current.isVisible()) {
					current = current.getParent();
				}
				else {
					return false;
				}
			}
			return true;
		} else {
			return false;
		}
	}

	//==============================================================================
	// 가시 상태 반환.
	//==============================================================================
	/**
	 * @returns { boolean } 
	 */
	isVisible() {
		return this.#isVisible;
	}

	//==============================================================================
	// 색상 설정.
	//==============================================================================
	/**
	 * @param { string } color 
	 */
	setColor(color) {
		this.#color = color;
	}

	//==============================================================================
	// 색상 반환.
	//==============================================================================
	/**
	 * @returns { string } 
	 */
	getColor() {
		return this.#color;
	}


	//==============================================================================
	// 투명도 설정.
	//==============================================================================
	/**
	 * @param { number } opacity 
	 */
	setOpacity(opacity) {
		this.#opacity = opacity;
	}

	//==============================================================================
	// 투명도 반환.
	//==============================================================================
	/**
	 * @returns { number } 
	 */
	getOpacity() {
		return this.#opacity;
	}

	//==============================================================================
	// 피봇 설정.
	//==============================================================================
	/**
	 * @param { VVector2 } pivot
	 */
	setPivot(pivot) {
		this.#pivot = pivot;
		this.#pivot.x = VMath.clamp(this.#pivot.x, 0, 1);
		this.#pivot.y = VMath.clamp(this.#pivot.y, 0, 1);
	}

	//==============================================================================
	// 피봇 반환.
	//==============================================================================
	/**
	 * @returns { VVector2 }
	 */
	getPivot() {
		return this.#pivot;
	}

	// //==============================================================================
	// // 새로운 노드 생성.
	// //==============================================================================
	// /**
	//  * @returns { VNode }
	//  */
	// static create() {
	// 	var obj = new VNode();
	// 	return obj;
	// }
}