//==============================================================================
// 포함 모듈 목록.
//==============================================================================
const System = globalThis;
import { Object } from "../base/object.js";


//==============================================================================
// 셋 (중복 불허 집합).
//==============================================================================
/**
 * @template T
 * @class
 */
export class Set extends Object {
	//==============================================================================
	// 멤버 변수 목록.
	//==============================================================================
	/** @private @type { Set<T> } */ #items;

	//==============================================================================
	// 생성.
	//==============================================================================
	/**
	 * @constructor
	 */
	constructor() {
		super();
		this.#items = new System.Set();
	}

	//==============================================================================
	// 데이터 추가.
	//==============================================================================
	/**
	 * @param { T } item 
	 */
	add(item) {
		this.#items.add(item);
	}

	//==============================================================================
	// 데이터 제거.
	//==============================================================================
	/**
	 * @param { T } item 
	 * @returns { boolean }
	 */
	remove(item) {
		return this.#items.delete(item);
	}

	//==============================================================================
	// 요소 포함 여부 반환.
	//==============================================================================
	/**
	 * @param { T } item 
	 * @returns { boolean }
	 */
	contains(item) {
		return this.#items.has(item);
	}

	//==============================================================================
	// 합집합. (Union)
	//==============================================================================
	/**
	 * @param { Set<T> } otherSet 
	 * @returns { Set<T> }
	 */
	union(otherSet) {
		const resultSet = new Set();
		for (const item of this.#items) {
			resultSet.add(item);
		}
		for (const item of otherSet.toArray()) {
			resultSet.add(item);
		}
		return resultSet;
	}

	//==============================================================================
	// 교집합. (Intersection)
	//==============================================================================
	/**
	 * @param { Set<T> } otherSet 
	 * @returns { Set<T> }
	 */
	intersection(otherSet) {
		const resultSet = new Set();
		for (const item of this.#items) {
			if (otherSet.contains(item)) {
				resultSet.add(item);
			}
		}
		return resultSet;
	}

	//==============================================================================
	// 차집합. (Difference)
	//==============================================================================
	/**
	 * @param { Set<T> } otherSet 
	 * @returns { Set<T> }
	 */
	difference(otherSet) {
		const resultSet = new Set();
		for (const item of this.#items) {
			if (!otherSet.contains(item)) {
				resultSet.add(item);
			}
		}
		return resultSet;
	}

	//==============================================================================
	// 대칭 차집합 (여집합). (Symmetric Difference)
	//==============================================================================
	/**
	 * @param { Set<T> } otherSet 
	 * @returns { Set<T> }
	 */
	symmetricDifference(otherSet) {
		const resultSet = new Set();
		for (const item of this.#items) {
			if (!otherSet.contains(item)) {
				resultSet.add(item);
			}
		}
		for (const item of otherSet.toArray()) {
			if (!this.contains(item)) {
				resultSet.add(item);
			}
		}
		return resultSet;
	}

	//==============================================================================
	// 전체 제거.
	//==============================================================================
	clear() {
		this.#items.clear();
	}

	//==============================================================================
	// 요소 수 반환.
	//==============================================================================
	/**
	 * @returns { number }
	 */
	getCount() {
		return this.#items.size;
	}

	//==============================================================================
	// 전체 요소 배열 반환.
	//==============================================================================
	/**
	 * @returns { T[] }
	 */
	toArray() {
		return Array.from(this.#items);
	}
}