//==============================================================================
// 포함 모듈 목록.
//==============================================================================
const System = globalThis;
import { Object } from "./object.js";


//==============================================================================
// 식별자 생성기.
//==============================================================================
export class Identifier extends Object {
	//==============================================================================
	// 멤버 변수 목록.
	//==============================================================================
	/** @private @type { number } */ #serialNumber; // 누적.
	/** @private @type { number } */ #increaseNumber; // 증가.

	//==============================================================================
	// 생성.
	//==============================================================================
	/**
	 * @param { number} initialSerialNumber  
	 * @param { number} initialIncreaseNumber 
	 */
	constructor(initialSerialNumber = 0, initialIncreaseNumber = 1) {
		super();
		this.#serialNumber = initialSerialNumber;
		this.#increaseNumber = initialIncreaseNumber;
	}

	//==============================================================================
	// 초기 상태로 되돌림.
	//==============================================================================
	reset() {
		this.#serialNumber = this.#serialNumber;
	}

	//==============================================================================
	// 호출마다 (1 or custom)씩 증가되는 식별자 반환.
	//==============================================================================
	/**
	 * @description 아이디 자동 생성 후 반환.
	 * @param { number } increaseNumber
	 * @returns { number }
	 */
	auto(increaseNumber = 0) {
		if (increaseNumber) {
			this.#serialNumber += increaseNumber;
		}
		else {
			this.#serialNumber += this.#increaseNumber
		}
		return this.#serialNumber;
	}
}


//==============================================================================
// 열거 식별자 생성기.
//==============================================================================
export class Enum extends Object {
	//==============================================================================
	// 멤버 변수 목록.
	//==============================================================================
	/** @private @static @type { Identifier } */ static #identifier = new Identifier(0, 1);

	//==============================================================================
	// 시작값으로 출발.
	//==============================================================================
	/**
	 * @static
	 * @returns { number }
	 */
	static begin() {
		Enum.#identifier.reset();
		return Enum.auto();
	}

	//==============================================================================
	// 값을 증가시켜서 반환.
	//==============================================================================
	/**
	 * @static
	 * @returns { number }
	 */
	static auto() {
		return Enum.#identifier.auto();
	}

	//==============================================================================
	// 고정 열거체 생성.
	//==============================================================================
	/**
	 * @static
	 * @returns { System.Object }
	 */
	static readonly(dictionary) {
		System.Object.freeze(dictionary);
	}
}